<template>
  <div>
    <el-page-header @back="goBack" content="猫咪贴士" style="margin-bottom:20px;"></el-page-header>
    <el-collapse v-model="activeName" accordion>
      <el-collapse-item name="1">
        <template slot="title">
          <i class="header-icon el-icon-petmaomi icno"></i>
          猫猫营养品知识手册
        </template>
        <p>一、营养与健康息息相关</p>
        <p>猫是肉食性动物，其饲料以肉为主。猫营养的好坏与其健康状况密切相关。营养好的猫体质健壮，对各种疾病的抵抗力强。营养不良的猫则在各个生长或繁殖阶段都会有所反映。母猫妊娠前和妊娠期的营养状况会直接影响胎儿的发育及仔猫的成活率。如刚出生的猫，体重低于90克就表明母猫营养不良。</p>
        <p>哺乳期的母猫营养水平的高低对仔猫的生长发育影响更大。4周龄幼猫除哺食母乳外，还应补食一些固体饲料。7周龄断奶后的小猫生长快，此时饲料的营养成分和数量十分重要。小猫生长到10一12周龄时，因体内自母乳中获得的抗体己消失，一旦营养缺乏即易患疾病，特别是消化系统疾病和呼吸系统疾病。</p>
        <p>营养良好并发育正常的公猫在8.5个月龄即达性成熟，营养不足时则向后推迟。一般母猫在7月龄达性成熟，而营养不良时则不发情，或虽能发情受精但妊娠后期会流产;有些即使勉强产仔，也只能是数量很少的弱仔，且成活率低。</p>
        <p>因此，养好猫的关键在于了解饲料的营养成分和营养价值，以及猫在不同生长时期的不同需求，并且合理配制饲料，使之得到满足。猫饲料中的营养成分包括水、蛋白质、碳水化合物、脂肪、维生素和矿物质等。</p>
        <p>二、选择优质的猫猫奶粉</p>
        <p>猫咪最主要通过蛋白质来摄取能量，因此它需要食用高蛋白的食物，蛋白质含量低的吃食引不起猫咪多大兴趣。糖和脂肪也是重要的能量来源，但糖分并不是猫咪饮食中所必需的。而动物脂肪则与糖分不同，它不仅可以为猫咪提供能量，还能够为猫咪提供大量的维生素A、脂肪酸和花生四烯酸，因此它是猫咪食品中不可或缺的重要营养成分。动物脂肪还能够使食物更加可口，让猫咪胃口大开。</p>
        <p>普通的牛奶不能提供小猫需要的蛋白质和油脂。而一些专用的猫奶粉，像哈氏速溶营养粉提供了正确均衡的油脂，维生素和矿物质。每一份粉配两份室温的水。不用时将本品冷藏。已冲的营养粉24小时内没有喝完要丢掉。打开的营养粉三十天后要丢掉。其它饮食建议，咨询兽医。</p>
        <p>另外，大部分小动物每3到4小时喂食一次，大一点的每6到8小时喂食一次。本产品目的只是用于间断性的食物或食物的补充。四盎司重的小猫每天冲两烫匙本品，把每天冲的量按每天喂的次数均分，保证每次进食量一致。</p>
        <p>三、挑选猫维他命补充物</p>
        <p>最常被人要求的补充品，就是维他命类的添加物了。但每样东西都有其适当的量，如红血球过多症就是这些产品存在体内过多所造成的。维他命补充的量和与食物的适当比例是很难判定的，所以还是请教您的兽医，介绍适合您情况的产品。如果您选择给您的猫维他命补充物，特别注意维他命A和D，过量是有毒的。这两种维他命一天只须很少量，所以补充物有无标志此两种维他命的浓度很重要。</p>
        <p>如果您的猫猫缺乏维生素，不妨试试用加拿大天然宝的猫用维他命丸(当然要在收益的指导下)本品可以被称之为猫只的美味营养大餐。它科学合理地糅合了多种矿物质、氨基酸精华，适合任何猫种，多年来一直为兽医所推荐使用。</p>
        <p>它是按照人类的保健品标准所研制的产品， 使用最上等的肝脏原料制成。能在低成本的前提下补充您爱宠饮食上的不足，确保它们能获得必须的营养。但假若你的猫猫并不缺乏维生素，就不需要为它添加过多的营养，否则恨意患上维生素A过多症。</p>
      </el-collapse-item>
      <el-collapse-item name="2">
        <template slot="title">
          <i class="header-icon el-icon-petyingduanmao icno"></i>
          猫咪护理备忘录
        </template>
        <p>每天应该做的事：</p>
        <p>1.注意室内的空气是否流通、干爽;是否有影响猫咪安全的物品存在。</p>
        <p>2.为爱猫准备好营养均衡的食物和干净的饮水。</p>
        <p>3.及时清理猫咪便盆，同时注意观察猫咪的粪便是否正常。</p>
        <p>4.如果是长毛猫的话，至少为其梳理一次毛，同时观察猫咪身体各部分包括眼、嘴、耳等是否有异常;5.每天至少要有一个小时以上的时间与猫咪相处并适当逗其玩耍。</p>
        <p>每个星期要做的事：</p>
        <p>1.检查猫咪是否有体外寄生虫并采取灭虫措施。</p>
        <p>2.清洁耳朵、眼角和检查清理牙齿。</p>
        <p>3.如果是长毛猫的话，可视情况饲喂一点化毛膏。</p>
        <p>每半个月要做的事情：为猫咪检查和修剪爪子。</p>
        <p>每个月要做的事情：根据猫咪的身体实际情况最好给爱猫洗一次澡。</p>
        <p>每半年要做的事情：采用药物进行一次体内驱虫。</p>
        <p>每年要做的事情：请兽医对猫咪防疫注射，同时进行一次较全面的身体检查。</p>
      </el-collapse-item>
      <el-collapse-item name="3">
        <template slot="title">
          <i class="header-icon el-icon-petArtboard icno"></i>
          猫癣的症状及其治疗的方法
        </template>
        <p>1、灰黄霉素要慎用</p>
        <p>尤其是一岁以下未成年的小猫，因为所有杀真菌的口服药对肝脏的损害非常大，将来会造成猫咪肝功能紊乱，留下病根。如果猫咪不是全身大面积的猫癣，就不要轻易服用灰黄霉素或其他杀真菌的口服药。即使猫咪患有全身的严重猫癣，服用灰黄霉素时要捣碎了或碾成粉，用食用油掺和着喂下去，而且最好是喂一天停一天这样间隔开来喂，即使这样服用的时间也不能超过2周。</p>
        <p>2、要有耐心</p>
        <p>猫咪患上猫癣后恢复情况跟猫咪本身的体质有很大关系。原来身体条件的好的猫，康复的周期短，原来身体条件不好的猫，康复时间长，而且可能很长(超过2个月或更长时间)。但是无论如何，治疗要坚持要有耐心。千万不可因为猫咪患了猫癣，大面积脱毛，变丑了，就抛弃他，猫癣绝对不是致命的病，从根本上说对猫咪的健康影响不大，所以一定要耐心。</p>
        <p>3、补充营养</p>
        <p>猫咪患上猫癣以后，除了外用克霉唑之类的药物外，很重要的一点就是补充营养，多晒太阳。这期间应该加强猫粮的营养，(如选用法国皇家的幼猫猫粮)，另外给猫咪服用动物用的维生素补充品“叭咪宝”，(或者把小儿善存，小施尔康之类儿童用的维生素药碾碎了拌在猫罐头里，效果相同，每天一颗)。</p>
        <p>补充药物服用时间可以长一点，3、4个月或者半年，即使猫癣好了以后也可以继续喂，增强体质。还要尽可能地让猫咪多晒太阳。</p>
        <p>4、勤消毒</p>
        <p>家中环境要勤消毒，尤其是猫咪常睡的窝，垫子，每天用按要求稀释后的宠物环境消毒液喷洒，家中的地板，家具要隔天或隔两天用稀释后的消毒液擦拭，能够有效的防止猫癣的扩散。</p>
        <p>5、及时发现</p>
        <p>已经出现在猫咪身上的大面积脱毛，当然是重度猫癣的特征，除了对这些部位搽克霉唑之类的外用药物以外，还一定要注意及时发现猫咪身上其他部位的新长出来的猫癣。做法是每天给猫咪上完药之后，顺着毛，用双手紧贴着猫咪的皮肤从脑袋到尾巴仔仔细细的摸一遍，如果手触及到硬硬的小疙瘩或小突起，翻开来毛来看看，可以发现一小块结痂，旁边还有一小撮皮屑，那就是新长的猫癣，这些部位千万别忘了也要上药，如果等到这些部位也发展成大面积脱毛，治疗就更难了。</p>
      </el-collapse-item>
      <el-collapse-item name="4">
        <template slot="title">
          <i class="header-icon el-icon-petmaomi icno"></i>
          如何知道宠物猫猫得了耳螨
        </template>
        <p>一、首先</p>
        <p>一定要学会自己洗，这是咪咪最基本的日常护理，可是不能偷懒哦!找光线好的地方，把咪咪的耳朵翻过来(扣脑袋上)。看看是不是耳道里面红褐色的东西更多?用棉棒往里面探一下，看看棉棒上是不是粘了更多红褐色液体?是否有深红褐色结痂样的小块儿?用手捻一下，那些小块不容易被捻均(如果是泥就容易被捻均了)。</p>
        <p>二、其次</p>
        <p>找放大镜一根(看报纸的就行)，仔细观察猫咪耳朵里红褐色的地方，有红褐色蚜虫似的小虫子在爬动，那就是耳螨了。洗耳液除了可以清洁耳道，还可以消炎，预防/治疗因为耳螨造成的中耳炎。耳油是杀虫的，但有毒，注意不要让猫咪去舔。</p>
        <p>三、再次，黑泥和耳螨。</p>
        <p>【1、颜色不同。】</p>
        <p>耳螨是深褐色的，如果仔细看，可以看到褐色或浅褐色的耳螨虫(用放大镜)。</p>
        <p>【2、污垢性状不同。】</p>
        <p>有耳螨的猫咪耳朵分泌很多类似油脂的褐色液体。耳螨垢呈不规则片状，贴在猫耳朵上。</p>
        <p>如果是泥的话，其一，分布应该均匀，不是一块一块的。其二：不应该有大量褐色液体分泌物。</p>
        <p>【3、触觉不同。】</p>
        <p>取一小块耳垢，用手指捻一下，泥很容易捻匀，感觉细腻。耳螨垢感觉粗糙，不容易捻开。</p>
      </el-collapse-item>
      <el-collapse-item name="5">
        <template slot="title">
          <i class="header-icon el-icon-petyingduanmao icno"></i>
          猫猫最讨厌三种事
        </template>
        <p>一、猫最讨厌受到惊吓</p>
        <p>用较大的声音突然去叫猫，或者开、关门时用力过猛，门铃响声和突然到访的朋友的喧哗声，都会使猫受到惊吓。导致猫突然站起来、毛发耸立，逃跑躲藏、甚至神经兮兮。</p>
        <p>二、猫讨厌被人的眼神长时间盯着</p>
        <p>猫被人盯着时它会感觉到被攻击的威胁，因此而紧张或生气。所以当你要与猫面对的时候，你一定要让脸上堆满灿烂的笑容，并尽量把眼睛眯起来或把视线移开。</p>
        <p>三、猫在睡觉时讨厌别人打扰</p>
        <p>猫每天占三分之二的时间都在睡觉，如果你想在猫睡觉的时候去和它亲热或逗其玩，那就大错特错了，其实此刻它对你的亲昵动作是极不耐烦和恨之入骨的!最后一点、年纪较老的的猫喜欢安静。当它远离你和呆在安静的环境时，你最好不要去打扰它!</p>
        <p>猫讨厌什么，主人最好要掌握清楚，尤其是家庭有小孩的，要加强对孩子的教育，不要因为孩子无意间的一些行为招惹了猫猫，而引致孩子被猫猫伤害的情况。</p>
      </el-collapse-item>
      <el-collapse-item name="6">
        <template slot="title">
          <i class="header-icon el-icon-petArtboard icno"></i>
          宠物猫的多渴多尿的尿崩症
        </template>
        <p>【症状：】</p>
        <p>多尿 脱水 多饮 排尿失禁 食欲下降</p>
        <p>【 病因：】</p>
        <p>尿崩症是由加压素合成或释放完全或部分障碍引起慢性尿崩症(CDI)，或者是由肾小管对加压素的反应完全或部分障碍引起肾性尿崩症(NDI)。两种类型的尿崩症都可以是先天性形成也可以是后天获得的。CDI可能由瘤形成或脑创伤引起，但一般在猫，该病都是先天形成的。炎症性或寄生虫引起的cDI很少见。</p>
        <p>【 症状描述：】</p>
        <p>临床表现尿崩症的症状包括明显多尿症。常表现出遗尿症和失禁，并表现严重的烦渴症状，有时24h饮水达200ml/kg，在后天病例中，动物突然表现临床 症状。患病猫寻找水源，表现厌食，体重逐渐减轻。</p>
        <p>尽管渴感越发强烈，但患病猫表现轻度到中度脱水。患病猫一般不表现其他临床症状，虽然有时神 经症状很明显，特别是尿崩症伴发肿瘤，如垂体肿瘤。</p>
        <p>【疾病诊断：】</p>
        <p>尿崩症必须和原发性烦渴伴发多尿病，也即心理性烦渴(PP)区分开来。在PP中，因过度饮水加压素的分泌相对较低，而且，因为肾脏要处理大量液体，使髓质张力降低，进而肾脏浓缩能力降低。</p>
        <p>【 疾病治疗：】</p>
        <p>对患扩散性下丘脑或垂体瘤的患病猫，特别是表现出神经症状的，愈后不良。脑部有创伤的愈后情况各异，有些病例会在几天或几周内自发痊愈，有些刨伤是永久性的。NDI愈后不良，为了采用更好的治疗办法，应诊断其原发性病因。</p>
      </el-collapse-item>
      <el-collapse-item name="7">
        <template slot="title">
          <i class="header-icon el-icon-petmaomi icno"></i>
          宠物猫秋季好发的三类疾病
        </template>
        <p>第一类是传染疾病：</p>
        <p>秋季好发的传染病主要是猫瘟，猫瘟的学名為泛白血球减少症，是由细小病毒科病毒引起的猫白血球急剧减少的一种急性传染病，其死亡率高且病程长。在秋季猫的体质较差，而此种致病的病毒在此气候活性最强，所以未接种过猫瘟疫苗的猫即使是足不出户也可能感染本病。</p>
        <p>被感染的猫主要表现為消化道症状，剧烈呕吐，继而伴发腹泻、高热，食欲全无，精神极度沉鬱，后期可能出现血便，病程一般会持续一周左右。停止呕吐且有 食欲则為康复的表现，此病的自然耐过率很低，如果您的爱猫出现呕吐、腹泻和体温升高，就应立即带牠到医院就诊。如果血液化验白血球在6000以下就基本可确诊本病，如果白血球在2000以上，治疗及时，其治癒率在85%以上。</p>
        <p>第二类呼吸道疾病：</p>
        <p>体弱、老年猫及纯种猫易发，此类病包括鼻炎、气管炎及支气管炎、肺炎。鼻炎的症状為持续鼻涕，一侧或双侧鼻孔有脓性鼻液流出，但没有咳嗽症状，不影响精神 和食欲。此病為慢性，一般消炎治疗效果不好，但部分可自癒，进一步发展可变為气管及支气管炎，症状為咳嗽，有时有鼻涕，严重时可导致体温升高，影响精神和 食欲。如果及时治疗可在一周左右治癒，如治疗不及时或体质过差，可能转為慢性或进一步发展為肺炎。</p>
        <p>肺炎一般有体温升高等全身症状，如果是大叶性肺炎可危及生命。此类病的预防主要注意环境冷热变化，减少给猫咪洗澡的次数，洗澡也要挑选相对暖和的时间，发情的猫不要放到户外。</p>
        <p>第三类是猫的老年病：</p>
        <p>同老人一样，天气冷，特别是初冬季节，肝功能障碍，肾功能衰竭，突发性心臟病及糖尿病的发病率都较其他季节会有显著提高的趋势。所以秋季应特别注意老年猫有无异常情况，如果发现应及时到医院治疗。</p>
        <p>在夏末就应该给猫加强营养，增强体质，秋季到来时应减少外界刺激及发情对它们的影响。按时接种疫苗，仔细观察它们的行為，这样才能使您的爱猫健康地度过秋季。</p>
      </el-collapse-item>
      <el-collapse-item name="8">
        <template slot="title">
          <i class="header-icon el-icon-petyingduanmao icno"></i>
          饮食不当容易导致猫咪消瘦
        </template>
        <p>有的家长不懂得科学养猫，给猫咪吃很便宜的猫粮或者干脆吃人吃的饭，猫咪饮食不当，这样不仅猫咪长不胖，更会造成猫咪的健康问题。猫咪食肉动物，获得营养的来源是脂肪和蛋白质，无法从碳水化合物也就是谷物中获得热量。</p>
        <p>而很便宜的低端猫粮是用谷物制成的，猫咪之所以很爱吃是因为里面有大量的添加剂，猫咪从低端猫粮里几乎无法获得营养;而肉汤拌馒头、小鱼拌米饭这样的食物也是以谷物为主，添加了少量的肉类，猫咪吃这样的食物总是吃很多却很难真正吃饱，有的家长跟我反映说自己的猫咪一次吃一大盆子饭，每天拉好多好多大便，可就是吃不胖，我一问吃什么，多是吃汤拌饭，猫咪无法从汤拌饭中吸收营养，吃多少拉多少，猫咪当然吃不胖。</p>
        <p>猫咪家长们如果想让猫咪胖乎乎的，一定要满足猫咪的营养需求，猫咪食物应以较为优质的猫粮或者肉类为主，猫咪的营养上来了，不仅会变得胖乎乎的，身体也会更加健康。</p>
      </el-collapse-item>
      <el-collapse-item name="9">
        <template slot="title">
          <i class="header-icon el-icon-petArtboard icno"></i>
          爱猫人士经常犯的十种错误
        </template>
        <p>1.草率收养</p>
        <p>假如你冲动购买一个新钱包或者一件新的T恤，如果发现它发错颜色或者不合身，都可以退还。无害，无犯规，钱包当然也不可能不可以遭受驳回。但是收养一个活的物体，有知觉的生物，比如猫之类的小动物，成为家庭中的一员，事情就完全不同了。收养一只猫，应该在做决定前慎重考虑。</p>
        <p>2.负责猫咪宠物店的费用</p>
        <p>收养一只猫几乎可以和收养一个孩子相比。任何一个负责任的收养机构都不会把一个宝贵的孩子让与一个在财政上没有任何准备给他或她最好照顾的人。一些庇护所和猫咪收养团并未做过此类调查，你应该满足猫的基本需求，以及对紧急情况的准备。</p>
        <p>3.失败的绝育手术</p>
        <p>每天我都读到恳求帮助的那些人因他们的猫未能绝育而烦恼：公猫的麝香溅在房子的每处或者逃到屋外与另外的公猫打架;雌猫在发情期带着他们大声的声音号叫;或者更糟，“诧异”产下一窝窝多余的小猫。社会面对的问题就是压倒一切猫数量，只有绝育。通过避免增加的医疗问题，没有理由不这样做。</p>
        <p>4.忽视必要的兽医治疗</p>
        <p>虽然猫可以很快从轻微的疾病中恢复，但是如果紧急情况没有及时意识到，他们一样会迅速死亡。猫需要一定的预防接种，需要每年检查，如果他们生病或者受伤是绝对需要并应该得到兽医的照顾。在选择(和雇佣)一个好的兽医时不要犹豫。</p>
        <p>5.猫粮选择的虚假经济</p>
        <p>购买便宜的猫粮节省下来的钱用于兽医治疗可以数百次。猫是天生的食肉动物，对肉类蛋白质的需要要有一个良好的来源。他们不需要大量的粮食填料，尤其是玉米，是许多猫粮制造商使用的廉价蛋白质来源。了解如何选择猫粮和选择你能负担得起的最好的猫粮。你会发现你的猫吃高品质的食品比较少，因为他们不需要暴食来获得他们所需要的营养物质。</p>
        <p>6.去爪手术并不属实</p>
        <p>许多无知的猫的新主人已经走去爪手术道路，当兽医问，“你想要把你的小猫去爪吗，当我们给它绝育的时候?”一些兽医认为去爪手术是一个“例行”的外科手术，而猫的倡导者认为残忍，不人道，而且几乎没有情况是必要的。了解了事实以便你能做出明智的决定。</p>
        <p>7.允许猫在户外自由散步</p>
        <p>许多人认为猫应该在户外自由，新鲜空气和充足阳光下生活，但还有些人也可以提供证据来表明猫完全在室内生活可以很开心和很健康。户外危险，室内简单，这两种观点无法进行辩论。幸运的是，有许多的妥协使你和你的猫得到两全其美的办法，同时保持他的安全和快乐。</p>
        <p>8.忽略猫砂盘的维护</p>
        <p>猫一贯用砂盘，如果它能保持非常干净，砂盘没有香味或者没有不愉快让猫爪来破坏。维护猫的砂盘保证你不会面临砂盘性能问题。警告：假如你的猫不管你小心维护突然开始在砂盘外面排尿，你应该立即怀疑尿路问题，这是兽医的一个紧急问题。</p>
        <p>9.考虑猫的属性</p>
        <p>当你加入猫爱好者行列，你很快就会发现，我们通常把我们的猫作为家庭成员，而不是“宠物”。虽然猫可能在一些司法管辖区的法律上在任期结束时都被认为是“财产”。你不再“拥有”猫比你拥有一个人更多。如果你还没有想通现在的区别，你的新猫会让你知道快速订购。事实上，许多爱猫人士把他们自己描述成被他们的猫拥有。</p>
        <p>10.不允许认为一只猫仅仅是只猫</p>
        <p>猫不是一个孩子，猫也不是一只狗。猫的独特方式使他们成为讨人喜欢的动物。另一方面，他们的一些特性可能表现为沮丧，因为我们不理解他们的需求。猫本能寻求高的地方并削尖他们的爪子，因为它们是猫，并不是因为他们顽固和悖逆。我们的工作是用可接受的方式来适应这些需求。</p>
      </el-collapse-item>
      <el-collapse-item name="10">
        <template slot="title">
          <i class="header-icon el-icon-petmaomi icno"></i>
          在猫受到惊吓后要提高警惕
        </template>
        <p>其实猫咪的胆是比较小的，一开始外界似乎对于它都显得很陌生。所以主人们要投入更多的时间去与它相处，这样才能让它对主人没有防范心理。尤其是当受到猫咪受到惊吓后，此时我们主人该怎么办呢?</p>
        <p>导致猫咪受到惊吓的外界因素的很多，比如像被人追赶，与其它动物争斗，闪电打雷，猛然换到一个新环境等。当这些因素刺激猫咪后，常会导致猫咪出现很多天不吃东西，不理主人，自己躲到无人的角落怎么喊都不出来，甚至偶尔会发出恐怖叫声。当我们的猫咪出现类似情形时，我们就应该提高警惕了。首先我们应当查看一下猫咪身上有没有受伤，如果有的话，应该立即治疗。如果没有，只是单纯的害怕的话，此时千万不要抓它，只要把它的饭菜放在能够够得着的地方，然后你便离开。如果你担心的话，可以走得远一点进行观察。等到猫咪认为外面安全了，它也许就会出来吃点的。除此之外，你也可以给它找点平常它最喜欢的玩具，吸引它的注意力。反正记准一点，不要离它太近。</p>
        <p>只要我们看见猫咪开始进食的话，基本上就没有什么大问题了。但是如果以上方法都试过，还是不见效果，建议就要带到医院去给医生看一下。</p>
      </el-collapse-item>
    </el-collapse>
  </div>
</template>

<script>
export default {
  name: "cat",
  data() {
    return {
      activeName: "1"
    };
  },
  methods: {
    goBack() {
      this.$router.replace("./look");
    }
  }
};
</script>

<style scoped>
.icno {
  margin-right: 10px;
  font-size: 18px;
}
</style>
