<template>
  <div>
    <el-page-header @back="goBack" content="养狗必知" style="margin-bottom:20px;"></el-page-header>
    <el-collapse v-model="activeName" accordion>
      <el-collapse-item name="1">
        <template slot="title">
          <i class="header-icon el-icon-petgou icno"></i>
          狗狗饲养需要注意的问题
        </template>
        <p>1、 长期用肉来喂犬</p>
        <p>在肉类食物中钙和磷的比例为1:20,钙少磷多,而犬食物中钙和磷的最合适比例为1.1-1.2:1,因此长时间的用肉来喂犬的话,幼犬非常容易发生佝偻病,成犬容易发生骨质疏松症</p>
        <p>2、 长时间的用肝脏配胡萝卜喂犬</p>
        <p>肝脏含很多维生素A,胡萝卜富含很多胡萝素,一个胡萝卜素能在体内分解成两个维生素A,长时间的喂容易致使维生素A中毒,也可致使佝偻病或骨质疏松症.</p>
        <p>3、 长期很多喂犬吃骨头</p>
        <p>有些人为了给犬补钙,很多喂犬吃骨头,犬吃了很多骨头后,易发生吐逆,拉肚子或便秘,严峻的会构成肠梗阻.鸡,鸭的小骨头比照尖硬,尽量不喂爱犬,以防扎伤或卡在消化道内.</p>
        <p>4、 狗狗不能吃以及不建议吃的食物</p>
        <p>巧克力,洋葱,大葱，葡萄,盐和香料，甜味食物，虾、蟹、墨鱼、章鱼、海蜇等海鲜以及竹笋、豆类等高纤维食物，菇类，牛奶，骨头</p>
        <p>5、 常常给犬洗澡</p>
        <p>有些主人觉得犬遛弯回来脏,每天洗澡,会构成很多疾病,尤其是皮肤病,正常每10-15天洗澡一次即可。而且运用宠物专用的浴液</p>
        <p>6、 免疫误区</p>
        <p>不及时给犬做免疫随时或许感染流行症,有些主人存在侥幸心理,认为自己的犬健康而不给犬做防疫,等到患病才追悔莫及.</p>
        <p>7、 补钙误区</p>
        <p>钙对动物机体有着重要作用,通常应当通过饮食来补钙,调度钙磷平衡,假设饮食中缺钙,就应适当弥补,不要长期,很多的给犬补钙,钙量过多会致使多种疾病,最好方法便是从幼犬初步饲喂优质犬粮.</p>
        <p>8、 不留意犬的口腔健康</p>
        <p>长期喂软的食物,并不留意给爱犬清洁口腔,会构成牙结石的构成,牙齿松动,牙龈炎证,齿根骨折等,有些口腔疑问还可致使心脏疾病.</p>
      </el-collapse-item>
      <el-collapse-item name="2">
        <template slot="title">
          <i class="header-icon el-icon-petgougou icno"></i>
          如何让狗狗乖乖吃药?
        </template>
        <p>◎ 胶囊 ◎</p>
        <p>喂食时，请一手拿着药锭，另一手打开狗狗的嘴巴，快速地将药锭放在舌根处，并合上嘴巴，握住上下颚约几秒钟，再用手「轻骚喉部」，让狗狗做出吞咽动作。另外，若家中的宝贝较为贪吃，不妨把药锭稍微弄碎，藏入肉干或零食中，并与正常饭零食一并放置于手掌中来喂食，比较不容易被识破喔!</p>
        <p>◎ 药粉 ◎</p>
        <p>药粉比起药锭来说比较苦，建议混在饲料或鲜食中，让狗狗一起食用。若上述方式还是让狗狗宁愿饿肚子也不吃的话，请毛主人准备蒸熟的地瓜泥，将药粉少量包入，相信香甜美味的「特制地瓜球」，多数狗狗都无法抵挡喔!</p>
        <p>◎ 药水 ◎</p>
        <p>利用没有装针的注射筒，吸取药水后，从狗狗的牙齿两侧慢慢注入，宁可少量多次，也千万不可贪快，否则可能会呛到或喷得到处都是喔!药粉同样也可以混在水中，利用注射筒来喂食。</p>
        <p>◎ 眼药水 ◎</p>
        <p>利用拇指将狗狗的下眼睑处拉开，再快速拿出眼药水，从眼睛上方滴入眼内即可;</p>点药前千万不可拿着眼药水，在宝贝面前晃来晃去，甚至告诉他：「我们要点药囉!你要乖乖喔!」，此做法不仅无法安抚情绪，反而会让狗狗更紧张喔!
      </el-collapse-item>
      <el-collapse-item name="3">
        <template slot="title">
          <i class="header-icon el-icon-petkeji- icno"></i>
          狗狗太瘦了怎么办？
        </template>
        <p>一、狗狗消瘦多见情况</p>
        <p>
          1、食物的缺少：因为狗狗患各种或某种疾病，食欲不振或呈现非常强的厌恶，或是口中有发炎症状，致使无法充份汲取具有营养价值的食物，即构成狗狗过瘦。
          <br />2、消化或吸收的缺陷：肠胃或肝脏、胰脏等的疾病，致使下痢或便秘表象;分化食物的消化酵素异常，营养素无法吸收等，是构成狗狗过瘦的原因。
        </p>
        <p>二、狗狗吃的多还瘦如何办?</p>
        <p>
          1、对于狗粮读：我们应当挑选蛋白质含量较高的狗粮。在挑选的时，请我们参照包装袋上的配方含量，来看蛋白质的含量。喂养高蛋白质的狗粮时，请减量喂养，不然很简单拉肚子。
          <br />2、对于驱虫读：当您发现您的狗狗消瘦时，请必定考虑到一个要害的问题，您是不是有守时给狗狗驱虫?寄生虫是致使狗狗消瘦的元凶之一，是有必要要留神的东西。
        </p>
        <p>三、狗狗厌食消瘦如何办?</p>
        <p>
          1、增大运动量：多点时刻陪着狗狗出去跑跑，厌食疑问就顺利的处理了。不过对于不一样的狗狗，最佳选用不一样的运动办法。
          <br />2、调整喂养时：最佳的处理办法是在炽热时多给狗狗弥补含糖含盐的水份，将往常喂养的时刻调整至气候清凉的夜晚或者清晨。
        </p>
      </el-collapse-item>
      <el-collapse-item name="4">
        <template slot="title">
          <i class="header-icon el-icon-petgou icno"></i>
          狗狗眼部常见的疾病
        </template>
        <p>狗眼睛最常见的疾病：结膜炎</p>
        <p>宠物犬的结膜炎一看名字就知道，是狗狗的结膜发炎，症状可能表现为眼睛睁不开、流眼泪、眼睛发红等情况。因为结膜是覆盖有眼睛表面阻挡外来刺激的一层保护膜，所以对于外界的刺激最先引起的也都是结膜上的症状，比如有脏东西进到眼睛里了、被烟熏了、被化学品喷进了眼睛，最先引起的也就是结膜发炎了。</p>
        <p>狗狗眼睛常见的疾病：角膜炎</p>
        <p>一直有种说法，眼睛是心灵的窗户，而角膜就是窗户的玻璃。角膜炎有许多情况都是由于外伤的刺激引起的，也有 因为像犬瘟这些传染病引起的并发症。角膜应该是透明、清澈的，在得角膜炎的时候，狗狗的角膜就会变得混浊，还会引起狗狗眼睛疼痛和流泪。但与结膜炎的区别是狗狗的眼睛看起来应该不是那么的红，主要的症状是集中在眼球中间的角膜部分。</p>
        <p>狗狗眼睛常见的疾病：眼睑内翻</p>
        <p>眼睑内翻听着貌似是一种挺严重的病，其实说白了就是我们常说的“倒睫”，狗狗的上眼皮的最里侧向眼睛里面翻，使得睫毛扎到眼睛里。有不少狗狗都有这个毛病，通过动个类似双眼皮手术就可以解决了。眼睑内翻会引起狗狗的眼睛爱流眼泪，总是眨眼，睫毛刺激眼睛的时间长了，就会引起角膜炎和结膜炎了。</p>
        <p>狗狗眼睛的常见疾病：白内障</p>
        <p>白内障是发生在狗狗眼球晶状体的疾病，是狗狗眼睛常见病里的一个比较严重的，因为它会引起狗狗的眼睛失明。得白内障的原因也挺多，有先天的原因，也有因为年纪大了的原因，或是受外伤以后引起的等等。刚开始得白内障的时候，狗狗并没有明显的视力不好的情况，随着晶状体的透明性减弱，慢慢视力就会受影响了。如果狗狗的年纪比较大了，那么在平时就要注意观察狗狗的眼球，如果发现没有以前亮了或是清澈了，就要有这个意识狗狗有可能得了白内障。</p>
      </el-collapse-item>
      <el-collapse-item name="5">
        <template slot="title">
          <i class="header-icon el-icon-petgougou icno"></i>
          预防宠物狗消化不良
        </template>
        预防宠物狗出现消化不良是每一个宠物主人应有的责任，狗成年后，身体各组织器官的生长速度从幼犬期的高速生长转变成逐渐减慢直至停止。狗的营养需要包括维持营养需要和特定的生理需要。维持营养需要是指健康的狗体重不增不减，没有运动的情况下，体内各种养分处于收支平衡的维持状态时，狗对能量、蛋白质、矿物质、维生素等的需要量。大部分狗都比较贪食，如果只顾满足狗的食欲，不加限制地供给食物，狗摄入的营养成分超过了其维持需要，则会使狗患上肥胖症，进而并发许多其他疾病。因此，成年犬食物的饲喂量应该取决于狗体型大小以及每天的能量消耗。
      </el-collapse-item>
      <el-collapse-item name="6">
        <template slot="title">
          <i class="header-icon el-icon-petkeji- icno"></i>
          如何判断出狗狗是否感冒
        </template>
        <p>春天是狗狗生病的高发季节，宠物主人该怎样了解到，自己的小犬是不是感冒了呢?</p>
        <p>纵哪怕是长毛品种，由于还没有长齐狗毛，抵抗力不足，特别怕 骤冷和冷风吹袭。帮助小狗御寒的办法有如下 几种：可以在窝内放些清洁的旧毛毯、厚毛巾等，有助于幼犬取暖 。</p>
        <p>若单独把幼犬买回家饲养，由于已离群，难 以依偎而相互取暖，也少了兄弟姐妹同它玩，以至周身发热，所以比较易 着凉。不要把小狗放在太通风的地方以 防冻坏。尤其是6-8周的小狗，最容易患感冒。如果不懂得料理，最好不要在冬天时买 幼犬。回暖后或等它年纪稍 大些再买。它的抵抗力会强一些。</p>
        <p>冬季犬舍内温度应保持在13-15℃之间。犬舍门可吊草苫，窗子可封上塑料布，对幼小狗的圈舍还可仿照塑料大棚方法进行保暖同时要堵塞墙壁一切缝隙，防止贼风侵袭。有条件的可用红外线灯照射，墙壁之间建火墙等，一般应配置狗床，上面垫上厚垫料，并且要勤换勤晒，保持干燥。天晴日暖时，让狗多晒太阳，加强运动，增强体质，提高抗病能力。</p>
      </el-collapse-item>
      <el-collapse-item name="7">
        <template slot="title">
          <i class="header-icon el-icon-petgou icno"></i>
          狗狗咳嗽怎么办?
        </template>
        <p>狗狗咳嗽的几种情况：</p>
        <p>普通咳嗽。狗狗和人一样，当兴奋、睡醒、受惊、食物呛等原因都会导致狗狗咳嗽，这种咳嗽一般短促而短暂，没有其他症状，完全不用担心。</p>
        <p>环境的突然改变导致狗狗咳嗽。从暖空气环境进入冷空气环境，烟雾、灰尘等微细颗粒刺激呼吸道，呛鼻气味(例如氨气，辣椒烟雾等)，慢性致病空气环境(例如新居的油漆味)，等等，都会导致狗狗咳嗽。如果是短暂的环境因素影响，一般不会出现连续长期的咳嗽，受到比较强烈刺激时，会伴有流鼻涕和流泪的情况，脱离有害环境就会好转和消失。</p>
        <p>狗狗长期生活在有害环境(例如甲醛超标环境)，那可能会出现长期连续干咳，此时呼吸道和肺部可能都已经出现病变了，需要找兽医。如果狗狗受到比较强烈的呼吸道刺激，例如浓氨气刺激，有可能灼伤呼吸道，这种情况会发炎，不能光靠转移环境，还需要找兽医进行专门治疗。</p>
        <p>狗狗有时候吃骨头鱼刺，或是撕咬一些多刺物品，都可能被异物卡住喉咙或是刺到牙龈，狗狗会自己主动咳嗽，希望把刺给咳出来。这种情况狗狗往往一边咳嗽，一边用爪子自己抓嘴巴，还不时短促尖锐地叫，很容易判断的。狗狗一般都不会被刺卡住，最终都能自己解决。如果狗狗自己解决不了，就一定要找兽医拔刺，防止中刺部位发炎。</p>
        <p>某些毒物中毒，也会导致狗狗咳嗽。这种情况，咳嗽短促平和，往往还伴有呕吐和白沫，白沫不粘稠，只要不存在肌无力和精神不振，一般喂点葡萄糖口服液或是肌苷口服液，即可没事。</p>
        <p>呼吸道炎症、肺炎、肠胃炎等病变，也会导致狗狗咳嗽。这种病变导致的咳嗽，往往是长期连续咳嗽，有的情况下是尖锐干咳，眼鼻有粘结物，腹泻呕吐，呕吐物比较粘稠,毛色暗淡，精神萎靡，食欲不振。这种情况要及早找兽医治疗。</p>
        <p>狗狗也有时候容易上火，也会导致咳嗽。这种情况出现的是干咳，往往会眼角有分泌物，眼睛有比较多血丝，便干，无其他明显的症状。这种情况，可以买点蛇胆川贝枇杷露或是牛黄清肺散喂一下即可。</p>
        <p>一些犬只在狂犬病发作前期，也会出现咳嗽。这种情况，狗狗会出现夹尾巴，到处乱窜，恐水，狂吠，吐白沫，眼光异样。由于现阶段狂犬病无有效疗法，一旦遇到这样情况，确认是狂犬后，要立即扑杀，防止狂犬病流行。</p>
      </el-collapse-item>
      <el-collapse-item name="8">
        <template slot="title">
          <i class="header-icon el-icon-petgougou icno"></i>
          狗狗常见的牙齿问题
        </template>
        <p>常见的狗狗牙齿问题：</p>
        <p>首先是牙齿松动的问题，一般情况是狗狗换牙的时候发生，狗狗4到6个月大的时候是一个换牙时期，跟人一样，会长出新的牙齿来替换幼年时的乳齿。这时如果新牙已经长出来，而乳牙还没完全脱落，就会造成一些牙齿松动的问题。遇到这种情况就要感觉带狗狗去看兽医牙科，否则狗狗新牙长出来就可能会发展弯曲，或者导致其他牙齿问题。成年的狗狗也会有牙齿松动的情况，一般发现了这些情况最好就要及时的就医。</p>
        <p>还有一些牙齿问题，例如：牙齿错位、牙周病，牙齿外伤、牙龈肿痛等。</p>
      </el-collapse-item>
      <el-collapse-item name="9">
        <template slot="title">
          <i class="header-icon el-icon-petkeji- icno"></i>
          幼犬洗澡注意事项
        </template>
        <p>刚出生的幼犬，由于身体虚弱，照顾的重任就都是主人来做了。同时也有很多人会问幼犬能不能洗澡，一般来说要等到出生满2个月后，身体较为强壮再洗澡。太小的幼犬，身体脏用擦拭就好，不要随便带去洗澡，免得生病哦!以下是幼犬洗澡注意事项：</p>
        <p>第一：幼犬幼犬多久可以洗澡：最好是满2个月龄、到新环境超过1星期已经适应、打过第一剂疫苗两周后的幼犬。2个月龄前身体不够强壮，容易患病受凉。未适应环境的幼犬，带去洗澡更容易紧张，所以要等适应环境后再洗澡。</p>
        <p>第二：幼犬多久洗一次澡：2个月龄到5个月龄的幼犬，每次洗澡尽可能间隔2个星期以上。期间若是身体脏，可以用干洗或擦拭的方法清洁身体。过度清洁容易使幼犬皮肤受到伤害哦。</p>
        <p>第三：幼犬洗澡注意事项：幼犬洗澡最怕着凉生病，所以一定要准备好毛巾、吹风机，且最好在中午出太阳时洗。洗前3小时不要吃东西，避免呕吐。洗完一定要吹干，耳朵、脚缝也要清洁完全。洗完不要马上抱出浴室避免着凉。</p>
      </el-collapse-item>
      <el-collapse-item name="10">
        <template slot="title">
          <i class="header-icon el-icon-petchongwuxiangquan icno"></i>
          幼犬的喂养方法
        </template>
        <p>宠物幼犬的喂养工作怎么做?幼犬的成长发育非常快。蛋白质是肌肉和骨骼生长中不可或缺的重要成分。幼犬食品中的蛋白质提供骨骼生长和发育所需的适当数量的钙，磷和矿物质。</p>
        <p>幼犬粮中钙磷含量通常比成犬的要高2 5 %到 3 5 %;如果给小狗喂食营养均衡全面的幼犬宠物食品(一般大品牌犬粮都符和AAFCO标准)，那么不再需要饲喂其它营养补充剂，否则有可能会发生破坏狗狗饮食平衡，影响身体健康。</p>
        <p>建议选择配方中含有较低的蛋白质，脂肪和卡路里，以防止它过快增长，降低它患上各种骨骼疾病的风险,幼犬的胃比较小，但是新陈代谢速度特别快，因此它们为了摄取足够的营养需要少吃多餐.</p>
        <p>提醒：主人在给狗狗换狗粮之前，务必慢慢的让狗狗替换新的狗粮，随意更换狗粮会引起狗狗的肠胃问题。以上这几点是饲养幼犬的重中之重。</p>
      </el-collapse-item>
    </el-collapse>
  </div>
</template>

<script>
export default {
  name: "dog",
  data() {
    return {
      activeName: "1"
    };
  },
  methods: {
    goBack() {
      this.$router.replace("./look");
    }
  }
};
</script>

<style scoped>
.icno {
  margin-right: 10px;
  font-size: 18px;
}
</style>
