<template>
  <div>
    <el-page-header @back="goBack" content="香猪百科" style="margin-bottom:20px;"></el-page-header>
    <el-collapse v-model="activeName" accordion>
      <el-collapse-item name="1">
        <template slot="title">
          <i class="header-icon el-icon-pet-xiaozhu1 icno"></i>
          盘点香猪养猪4大注意要点
        </template>
        <p>1、建好猪舍应选择地势干燥，背风向阳，平整的地方建造猪舍。猪舍的形式采用单列式或双列式均可，但必须用砖石砌墙，水泥抹面，以便冲洗打扫，保持猪舍清洁。小香猪的猪舍应比一般猪舍建造高一些。根据小香猪饲养户的经验，每头小香猪应占地0.8平方米，每个圈养8头～10头适宜。猪舍外应设排粪场，排粪场的面积应比猪舍大一点，按每头猪1.5平方米计算，10头猪应建15平方米的排粪场。夏天猪要搭遮荫的凉棚。冬天要用塑料棚以提高室温，这是养好小香猪的一个重要条件。</p>
        <p>2、强化哺乳仔猪管理饲喂好仔猪是提高成活率和商品猪的关键，小香猪出生后，要固定好母猪的乳头，让仔猪吃好初乳，并加强保温，让其早开食，一般出生4天后就可补喂精饲料，一月龄后就要及时注射猪温、猪丹毒、猪肺疫疫苗。</p>
        <p>3、科学饲养成猪小香猪活泼好动，又胆小怕惊吓，所以要保持安静、干燥、洁净的饲养环境。以大麦、米糠、麸皮等饲料为主饲喂。但对断奶的仔猪要饲喂配合饲料，其饲料配方为：玉米10%，米糠50%，豆饼8%～10%，麸皮30%，面粉1%，食盐0.5%，每公斤饲料应含有消化能10.5兆焦，粗蛋白质16.2%。为了提高饲料报酬，尽快达到商品猪的标准，应实行科学饲喂，一是要定时，每日4餐，从早上7点开始，每隔4小时一次;二是定量，对体重20公斤以上的猪，按其体重的4.5%投料，20公斤以内的猪八戒按其体重的3.5%投料.同时做到前敞后限，即2月龄让其多活动，促其长架子，2月龄以后，限制其活动，促其长膘，以保证较高的出肉率。</p>
        <p>4、注意防疫治病一是无病早防，每天冲洗粪便1次，夏搭凉棚遮阳，冬扣暖棚保温，经常刷洗食槽、水槽，定期消毒猪舍;二是有病早治，特别是要注意防治仔猪副伤寒病。</p>
      </el-collapse-item>
      <el-collapse-item name="2">
        <template slot="title">
          <i class="header-icon el-icon-pet-xiaozhu icno"></i>
          香猪护理 多吃粗粮
        </template>
        <p>多吃粗粮常洗澡</p>
        <p>有些主人对小香猪特别疼爱，经常拿家里的好东西给它们吃，生怕它们受委屈。其实就像狗狗需要狗粮一样，小猪的肠胃也有自己的特点，人类的食物不一定适合它们。和狗狗相比，宠物香猪的食性更杂，也就是更好喂养，但也不能过于随便。</p>
        <p>农村养猪是喂糠的，宠物香猪还用吃吗?答案是肯定的。虽然糠是粗粮，但它对保持宠物香猪的肠胃功能很有帮助。红薯也有类似的功效。除了粗粮，宠物香猪还可以吃一些玉米和豆类，增加营养。</p>
        <p>宠物香猪对均衡营养的要求更高些，所以主人可以在它们的食物中添加些鱼骨粉之类的东西。</p>
        <p>家里的饭菜也可以挑着给宠物香猪吃一些，作为辅助性食物，但不能成为主食。宠物香猪的主食应该以粗粮为主，吃得太细它们会便秘的哟。把各种原料混在一起，搅拌均匀，稍微加热，小猪们最爱吃了。</p>
        <p>虽然名字叫香猪，其实小猪本身是不会发出香味的，当然也没有特别的臭味。小香猪也需要经常洗澡，以三天左右洗一次为宜。和狗狗比起来，为小香猪洗澡方便多了。主人可以买一把柔软些的刷子，轻轻地给小香猪全身刷一刷就行了。</p>
      </el-collapse-item>
      <el-collapse-item name="3">
        <template slot="title">
          <i class="header-icon el-icon-petzhu icno"></i>
          宠物猪的个性特征
        </template>
        <p>1、天性聪明，活泼好动，好奇心强。</p>
        <p>2、很通人性，会认主人，只要主人对它好，他也会以优秀的表现来回报主人。</p>
        <p>3、喜欢和主人一起出去散步。</p>
        <p>4、很爱干净，会固定地方大小便。</p>
        <p>5、杂食性，不挑食，可以吃剩菜剩饭(建议只给一些米饭、稀饭及青菜，不要给它吃荤菜和油腻的东西)。</p>
      </el-collapse-item>
      <el-collapse-item name="4">
        <template slot="title">
          <i class="header-icon el-icon-pet-xiaozhu1 icno"></i>
          养宠物猪的十大理由
        </template>
        <p>1、比狗狗更可爱;</p>
        <p>2、抵抗力强，极少生病;</p>
        <p>3、不用办证，不怕打狗队;</p>
        <p>4、吃素食，吃得少，经济省钱;</p>
        <p>5、认主人，对主人忠心;</p>
        <p>6、嗅觉比狗强10倍;</p>
        <p>7、无体臭;</p>
        <p>8、近年来最流行的宠物，显现个性;</p>
        <p>9、短毛，干净，会固定地方大小便，轻松打理;</p>
        <p>10、少叫，不扰邻。</p>
      </el-collapse-item>
      <el-collapse-item name="5">
        <template slot="title">
          <i class="header-icon el-icon-pet-xiaozhu icno"></i>
          小香猪护理 冬保暖少不得
        </template>
        <p>香猪真的很怕冷，刚出生的小猪需要用灯泡照着取暖，特别是在北方繁殖的猪猪。冬天北方气候寒冷，因为冷有暖气，是个很大的优势，简单的说，养猪冬季注意事项：</p>
        <p>1. 室温20度以上比较适合猪猪，即便如此，一个暖和的窝也是必不可少的，这个窝需要达到棉被级别。</p>
        <p>2. 尽量不要外出，如果一定要出去，穿上保暖的衣服，在有太阳的日子出去。曾经有小猪在雪天出去玩，回来感染了呼吸道疾病进而转成肺炎，这不是开玩笑，这个病是要命的。年纪越大的猪抗冻能力越强，八九个月以上的胖猪就不太怕，出去大便不会有问题，但不能时间太长。</p>
        <p>3. 冬季饮食上要适当多一点，让猪猪摄入充足的热量御寒。另外冬季也不要忘记让猪猪吃一定量的水果蔬菜，防止春天到来时猪猪上火。</p>
      </el-collapse-item>
      <el-collapse-item name="6">
        <template slot="title">
          <i class="header-icon el-icon-petzhu icno"></i>
          威胁小香猪生命的九种疾病
        </template>
        <p>一、猪 瘟</p>
        <p>猪瘟又叫烂肠瘟，是猪的一种高度传染性病毒病。猪瘟可分急性、亚急性、慢性3种。本病一年四季都可发生，不分猪种、年龄、性别都可感染本病。本病大多由消化道感染，也可通过呼吸道感染。</p>
        <p>二、猪丹毒</p>
        <p>猪丹毒是猪的一种急性传染病，通常呈高度发热的败血症，夏秋两季发生较多，一般分急性、亚急性和慢性3种。急性死亡率高。本病多由消化道感染。</p>
        <p>三、猪肺疫</p>
        <p>猪肺疫又称锁喉风，是由巴氏杆菌引起的一种急性传染病，多发于夏、秋季节，中、小猪容易感染，一般呈散发或地方性流行。本病多经呼吸道感染。</p>
        <p>四、仔猪白痢</p>
        <p>仔猪白痢是由致病性大肠杆菌引起的哺乳仔猪传染病，多发生在20日龄以内的仔猪。本病一年四季均可发生。</p>
        <p>五、仔猪红痢</p>
        <p>仔猪红痢又称出血性肠炎，是由c型魏氏梭菌引起，主要发生于3日龄以内的仔猪。在流行地区，仔猪发病率很高，常造成大批仔猪死亡，死亡率可达100%。</p>
        <p>六、仔猪黄痢</p>
        <p>仔猪黄痢是由大肠杆菌引起初生仔诸肠道急性传染的传染病，多见于1~3日龄的仔猪，7日龄以上的仔猪发病极少。本病的发病率和死亡率可高达90%~100%。</p>
        <p>七、猪喘气病</p>
        <p>猪喘气病又称猪霉形体肺炎、猪地方性流行性肺炎，是由猪霉形体所引起的一种急性或慢性接触性传染病，其主要特征是患病猪咳嗽气喘。</p>
        <p>八、消化不良</p>
        <p>消化系统器官功能受到扰乱或障碍，胃肠消化、吸收功能减退，食欲减少或无食欲，统称为消化不良。主要是因为突然变换饲料，或喂给变质的饲料引起的，长期运输等也可引起消化不良。</p>
        <p>九、坏死性口炎</p>
        <p>本病是坏死杆菌引起的一种慢性细菌性传染病，多呈散发性。本病一般是猪皮肤粘膜创伤或咬伤，病菌乘机侵入而导致的，一年四季均有发生。</p>
      </el-collapse-item>
      <el-collapse-item name="7">
        <template slot="title">
          <i class="header-icon el-icon-pet-xiaozhu1 icno"></i>
          香猪不同阶段的养殖
        </template>
        <p>香猪的不同生长阶段，饲料比例适当变动。原则是前期精料多，后期精料少。</p>
        <p>不同阶段的巴马香猪对饲料蛋白质含量要求如下：2~3月龄仔猪为14%~15%；4~6月龄猪和哺乳期母猪为12%~14%；空怀期母猪为8%~10%；种猪为13%~15%。而不同阶段的巴马香猪喂精饲料用量如下：大猪每天1.5~2公斤，幼年猪每天1~1.5公斤。粉状饲料应加清水搅拌至干湿适宜再投喂。颗粒饲料可直接投喂，要保证充足饮水。青饲料洗净，切碎后拌精饲料饲喂，也可以不切碎在饲喂精饲料后投喂。</p>
        <p>1.小香猪养殖</p>
        <p>小香猪出生后，要固定好母猪的乳头，让仔猪吃好初乳，并加强保温，让其早开食，一般出生4天后就可补喂精饲料。对断奶的仔猪则要饲喂配合饲料，其饲料配方为：玉米10%，米糠50%，豆饼8.5%，麸皮30%，面粉1%，食盐0.5%，每千克饲料应含有消化能10.5MJ，粗蛋白质16.2%。每天喂4次。</p>
        <p>2.成年香猪养殖</p>
        <p>常用饲料的配比是玉米56%、豆饼15%、麦麸19.5%，各种糠类7%，骨粉、鱼粉各占1%，食盐0.5%。每天喂3次。</p>
        <p>3.小贴士</p>
        <p>1）冬季时，香猪的身体能量消耗大，所以必须保证吃食足量，饲料配比合理才行。饲料种类应尽可能多样化，使所配日粮的各种饲料在营养上能够互相补充。</p>
        <p>2）香猪因有吃青饲料的习性，所以在饲养中这是一个不可忽视的问题。冬季可用白菜、萝卜、胡萝卜、土豆（土豆熟喂好）代替青饲料;但腐烂变质的蔬菜不要喂！</p>
      </el-collapse-item>
      <el-collapse-item name="8">
        <template slot="title">
          <i class="header-icon el-icon-pet-xiaozhu icno"></i>
          教你认准纯正香猪
        </template>
        <p>1、香猪和两头乌一样，都是两头黑色的，区别是：香猪背上那块比较大，而两头乌背上黑色那块小多了(或者就屁股有);</p>
        <p>2、香猪背上黑色那块的边缘是黑皮白毛;</p>
        <p>3、香猪眉心一般有白斑(也听说过没有的)，但是买的时候要小心是染色的;</p>
        <p>4、香猪的耳朵比较小，直立的，肉猪的较大;</p>
        <p>5、香猪头上皱纹明显，肉猪皱纹不明显的;</p>
        <p>6、以上都是表象，后来我突然想到有个法子也许很管用，那就是看猪猪的牙齿，想想外面卖的猪猪一般3斤左右，3斤左右的香猪牙齿都长齐了的，而肉猪的牙齿都没长齐呢。</p>
      </el-collapse-item>
    </el-collapse>
  </div>
</template>

<script>
export default {
  name: "pig",
  data() {
    return {
      activeName: "1"
    };
  },
  methods: {
    goBack() {
      this.$router.replace("./look");
    }
  }
};
</script>

<style scoped>
.icno {
  margin-right: 10px;
  font-size: 18px;
}
</style>
